Revit 2027 API
LabelUtils.GetLabelFor(BuiltInParameter, LanguageType) Method
 Gets the user-visible name for a BuiltInParameter in a specific LanguageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	BuiltInParameter builtInParam,
	LanguageType language
)
Public Shared Function GetLabelFor (
	builtInParam As BuiltInParameter,
	language As LanguageType
) As String
public:
static String^ GetLabelFor(
	BuiltInParameter builtInParam,
	LanguageType language
)
static member GetLabelFor :
        builtInParam : BuiltInParameter *
        language : LanguageType -> string
Parameters
builtInParam BuiltInParameter
 The BuiltInParameter to get the user-visible name.
language LanguageType
 The desired LanguageType to get the user-visible name in.
Return Value
String
 The BuiltInParameter name in the desired LanguageType.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the BuiltInParameter cannot be found.
InvalidOperationException |  Thrown when the desired LanguageType cannot be found for the BuiltInParameter name.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace